<?php

return [
    'required' => 'حقل :attribute مطلوب.',
    'email' => 'يجب أن يكون حقل :attribute عنوان بريد إلكتروني صالح.',
    'max' => [
        'string' => 'يجب ألا يتجاوز حقل :attribute :max حرفًا.',
    ],
    'min' => [
        'string' => 'يجب أن يحتوي حقل :attribute على الأقل :min حروف.',
    ],
    'confirmed' => 'تأكيد :attribute غير متطابق.',
    'unique' => 'قيمة :attribute مُستخدمة من قبل.',
    'exists' => 'الـ :attribute المحدد غير صالح.',
    'string' => 'يجب أن يكون حقل :attribute نصاً.',
    'numeric' => 'يجب أن يكون حقل :attribute رقماً.',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    */

    'attributes' => [
        'name' => 'الاسم',
        'email' => 'البريد الإلكتروني',
        'password' => 'كلمة المرور',
        'code' => 'رمز التحقق',
        'token' => 'رمز التوكن',
    ],
];
